{
  "header": {
    "home": "Inicio",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "about": "Sobre mí",
    "contact": "Contacto",
    "resume": "Currículum"
  },

  "home": {
    "title": "Hola, soy Andy Álvarez",
    "button": "¡Contrátame!"
  },

  "skills": {
    "title": "Habilidades"
  },
  
  "projects": {
    "title": "Proyectos",
    "modal": {
      "technologies": "Tecnologías Utilizadas",
      "description": "Descripción del Proyecto",
      "features": "Características Clave",
      "featuresList": []
    },
    "list": {
      "expense": {
        "title": "Planificador de Gastos",
        "description": "Aplicación web de planificación de gastos personales, diseñada para gestionar tus finanzas de manera rápida y sencilla.",
        "extended": "Aplicación web completa para gestionar finanzas personales de forma eficiente.\n\n✨ Desarrollada con React, TypeScript y TailwindCSS para una interfaz moderna, intuitiva y totalmente responsiva.\n\n🔧 Implementa Context API para gestión de estado global, hooks personalizados para lógica reutilizable y validación robusta de formularios.\n\n💾 Utiliza localStorage para persistencia de datos, manteniendo todo el historial de gastos incluso al cerrar el navegador.\n\n📊 Incluye filtros por categoría, visualización de presupuesto disponible, gastos realizados y resumen financiero en tiempo real.\n\n✅ Código limpio y bien estructurado siguiendo las mejores prácticas de arquitectura frontend y principios SOLID.",
        "features": [
          "Interfaz moderna y totalmente responsiva con React y TypeScript",
          "Gestión de estado global eficiente con Context API",
          "Filtros por categoría y resumen financiero en tiempo real",
          "Persistencia de datos con localStorage",
          "Validación robusta de formularios y hooks personalizados",
          "Código limpio siguiendo principios SOLID"
        ]
      },
      "fintrack": {
        "title": "Fintrack Dashboard",
        "description": "Dashboard interactivo para monitorizar tipos de cambio y finanzas en tiempo real.",
        "extended": "Aplicación web avanzada para visualizar y seguir la evolución de múltiples divisas y datos financieros.\n\n✨ Interfaz moderna y completamente responsive construida con React, TypeScript y TailwindCSS, ofreciendo experiencia intuitiva y profesional.\n\n🔧 Utiliza hooks personalizados para lógica reusable y gestión del estado con React, asegurando código limpio y modular.\n\n💾 Integra fetch de datos en tiempo real desde la API de Frankfurter, mostrando tasas de cambio actuales y variación del día anterior.\n\n📊 Visualiza tasas en columnas con indicadores de incremento o decremento, banderas de país y actualización en vivo de cambios porcentuales.\n\n✅ Código bien estructurado y comentado siguiendo buenas prácticas de arquitectura frontend y principios SOLID, listo para extensión futura o integración con otras funcionalidades.",
        "features": [
          "Interfaz intuitiva y responsive para monitoreo de divisas",
          "Actualización en tiempo real de tasas y cambios porcentuales",
          "Visualización clara con banderas, símbolos y cambio diario",
          "Hooks personalizados para lógica reusable",
          "Código modular, comentado y siguiendo principios SOLID",
          "Optimizado para escalabilidad y futuras funcionalidades"
        ]
      },
      "patient": {
        "title": "Patient Manager",
        "description": "Aplicación para registrar pacientes y gestionar historiales médicos veterinarios.",
        "extended": "Sistema de gestión de pacientes veterinarios con historial médico completo.\n\n🐾 Aplicación diseñada específicamente para clínicas veterinarias, facilitando el registro y seguimiento de los pacientes animales.\n\n💉 Permite registrar información detallada: datos del paciente, propietario, síntomas, diagnósticos, tratamientos y citas de seguimiento.\n\n📝 Desarrollada con React y TypeScript, asegurando tipado fuerte y código mantenible para la gestión de datos sensibles.\n\n🎨 Interfaz limpia y funcional con TailwindCSS, optimizada para un uso rápido en consultas veterinarias.\n\n💾 Almacenamiento local con localStorage, garantizando acceso inmediato al historial de cada paciente.\n\n✅ Incluye funcionalidades de búsqueda, edición y eliminación con validación de formularios.",
        "features": [
          "Sistema completo de registro de pacientes veterinarios",
          "Historial médico detallado con síntomas y tratamientos",
          "Gestión de datos de propietarios y citas de seguimiento",
          "Interfaz optimizada para el uso en clínicas",
          "Funcionalidades de búsqueda, edición y eliminación de registros",
          "Persistencia de datos local con localStorage"
        ]
      },
      "payflow": {
        "title": "PayFlow - Fintech",
        "description": "Landing page moderna de una fintech, diseñada para generar confianza y conversión.",
        "extended": "Landing page profesional para una aplicación financiera digital.\n\n💳 Diseño atractivo enfocado en la conversión de usuarios y la confianza en servicios financieros digitales.\n\n🎨 Construida con React y TailwindCSS, con animaciones suaves y diseño responsive para todos los dispositivos.\n\n🚀 Optimizada para un rendimiento rápido y experiencia de usuario fluida.\n\n✨ Incluye secciones de funcionalidades, testimonios, precios y llamadas a la acción estratégicas.\n\n📱 Totalmente adaptable a móvil, tablet y escritorio con enfoque mobile-first.",
        "features": [
          "Diseño moderno con animaciones y transiciones suaves",
          "Secciones estratégicas para conversión y testimonios",
          "Optimización de rendimiento y carga ultra rápida",
          "Diseño responsive mobile-first",
          "Integración efectiva de llamadas a la acción"
        ]
      }
    },
    "links": {
      "web": "Ver Demo",
      "code": "Ver Código"
    },
    "button": "Ver Más Proyectos"
  },

  "about": {
    "title": "Sobre Mí",
    "p1": "👋 Hola, soy Andy Álvarez, Frontend Developer de Barcelona. Me especializo en React, TypeScript y Tailwind CSS, creando aplicaciones web responsivas, escalables y centradas en el usuario.",
    "p2": "💻 Cuento con alrededor de 2 años de experiencia en proyectos personales y freelance, desarrollando landing pages, e-commerce y demos interactivas.",
    "p3": "🚀 Me apasiona aprender nuevas tecnologías, escribir código limpio y reutilizable, y transformar problemas complejos en soluciones simples y efectivas.",
    "p4": "🤝 Disfruto trabajando en entornos colaborativos y dinámicos, contribuyendo a proyectos que generen impacto y me permitan crecer profesionalmente."
  },

  "contact": {
    "title": "Contacto",
    "name": "Nombre",
    "email": "Correo electrónico",
    "message": "Escribe tu mensaje aquí...",
    "buttonText": "Enviar",
    "buttonText1": "¡Mensaje enviado!",
    "buttonText2": "Enviando...",
    "error": "Hubo un error al enviar tu mensaje. Por favor, inténtalo de nuevo.",
    "validators": {
      "name": "El nombre es obligatorio",
      "email": "Por favor, introduce un correo electrónico válido",
      "message": "El mensaje es obligatorio"
    }
  },

  "footer": {
    "text": "Diseñado & desarrollado por mí"
  }
}
